<?php
ob_start();
session_start();
//Debug 
define('DEBUG',false);
define('LOCAL',false);

//set timezone
date_default_timezone_set('Europe/Kiev');
if (defined('LOCAL')&& LOCAL) {
//database credentials denwer
define('DBHOST','localhost');
define('DBUSER','root');
define('DBPASS','');
define('DBNAME','site_db');
}
else {
//database credentials hosting
define("DBHOST", "localhost");
define("DBUSER", "dfsu");
define("DBPASS", "Centre-2017/08/01");
define("DBNAME", "site_db");
}

//application address
define('DIR','http://www.centre-kiev.kiev.ua/register/');
define('SITEEMAIL','noreply.centrekievmail@gmail.com');
function adefine($value) {
	$admin1=$value; echo "adefine=".$admin1."! value=". $value;
	return $value;
}
function grname($groupcat){
    switch ($groupcat) {
        case '20':	$groupname='Модуль 1. «Лідерство та ефективне управління» 4 вересня 2017 року.'; break;
        case '21':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 4 вересня 2017 року.'; break;
		case '22':	$groupname='Модуль 3. «Лідерство та управління персоналом» 4 вересня 2017 року.'; break;
		case '23':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 4 вересня 2017 року.'; break;
		case '24':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 4 вересня 2017 року.'; break;

        case '25':	$groupname='Модуль 1. «Лідерство та ефективне управління» 5 вересня 2017 року.'; break;
        case '26':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 5 вересня 2017 року.'; break;
		case '27':	$groupname='Модуль 3. «Лідерство та управління персоналом 5 вересня 2017 року.'; break;
		case '28':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 5 вересня 2017 року.'; break;
		case '29':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони»5 вересня 2017 року.'; break;

        case '30':	$groupname='Модуль 1. «Лідерство та ефективне управління« 6 вересня 2017 року.'; break;
        case '31':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 6 вересня 2017 року.'; break;
		case '32':	$groupname='Модуль 3. «Лідерство та управління персоналом» 6 вересня 2017 року.'; break;
		case '33':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 6 вересня 2017 року.'; break;
		case '34':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 6 вересня 2017 року.'; break;

        case '35':	$groupname='Модуль 1. «Лідерство та ефективне управління» 7 вересня 2017 року.'; break;
        case '36':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 7 вересня 2017 року.'; break;
		case '37':	$groupname='Модуль 3. «Лідерство та управління персоналом» 7 вересня 2017 року.'; break;
		case '38':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 7 вересня 2017 року.'; break;
		case '39':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 7 вересня 2017 року.'; break;
	
        case '40':	$groupname='Модуль 1. «Лідерство та ефективне управління» 8 вересня 2017 року.'; break;
        case '41':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 8 вересня 2017 року.'; break;
		case '42':	$groupname='Модуль 3. «Лідерство та управління персоналом» 8 вересня 2017 року.'; break;
		case '43':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 8 вересня 2017 року.'; break;
		case '44':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 8 вересня 2017 року.'; break;

        case '50':	$groupname='Модуль 1. «Лідерство та ефективне управління» 18 вересня 2017 року.'; break;
        case '51':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 18 вересня 2017 року.'; break;
		case '52':	$groupname='Модуль 3. «Лідерство та управління персоналом» 18 вересня 2017 року.'; break;
		case '53':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 18 вересня 2017 року.'; break;
		case '54':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 18 вересня 2017 року.'; break;

        case '55':	$groupname='Модуль 1. «Лідерство та ефективне управління» 19 вересня 2017 року.'; break;
        case '56':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 19 вересня 2017 року.'; break;
		case '57':	$groupname='Модуль 3. «Лідерство та управління персоналом» 19 вересня 2017 року.'; break;
		case '58':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 19 вересня 2017 року.'; break;
		case '59':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 19 вересня 2017 року.'; break;

		case '60':	$groupname='Модуль 1. «Лідерство та ефективне управління» 20 вересня 2017 року.'; break;
        case '61':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 20 вересня 2017 року.'; break;
		case '62':	$groupname='Модуль 3. «Лідерство та управління персоналом» 20 вересня 2017 року.'; break;
		case '63':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 20 вересня 2017 року.'; break;
		case '64':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 20 вересня 2017 року.'; break;

        case '65':	$groupname='Модуль 1. «Лідерство та ефективне управління» 21 вересня 2017 року.'; break;
        case '66':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 21 вересня 2017 року.'; break;
		case '67':	$groupname='Модуль 3. «Лідерство та управління персоналом» 21 вересня 2017 року.'; break;
		case '68':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 21 вересня 2017 року.'; break;
		case '69':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 21 вересня 2017 року.'; break;

        case '70':	$groupname='Модуль 1. «Лідерство та ефективне управління» 22 вересня 2017 року.'; break;
        case '71':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 22 вересня 2017 року.'; break;
		case '72':	$groupname='Модуль 3. «Лідерство та управління персоналом» 22 вересня 2017 року.'; break;
		case '73':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 22 вересня 2017 року.'; break;
		case '74':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 22 вересня 2017 року.'; break;

        case '90':	$groupname='Професійна програма підвищення кваліфікації державних службовців (6 група оплати праці). Термін навчання: 04-15 вересня 2017 року.'; break;
        case '91':	$groupname='Тематичний короткостроковий семінар «Європейські стандарти демократичного врядування». Термін навчання: 07-08 вересня 2017 року.'; break;
		case '92':	$groupname='Тематичний короткостроковий семінар «Україна-НАТО: напрями співробітництва та партнерства». Термін навчання: 07-08 вересня 2017 року.'; break;
		case '93':	$groupname='Тематичний короткостроковий семінар «Інноваційні технології в публічному управлінні». Термін навчання: 11-12 вересня 2017 року.'; break;
		case '94':	$groupname='Тематичний короткостроковий семінар «Смарт-технології». Термін навчання: 14-15 вересня 2017 року.'; break;

        case '95':	$groupname='Тематичний короткостроковий семінар «Стратегічне управління та планування». Термін навчання: 18-19 вересня 2017 року.'; break;
        case '96':	$groupname='Тематичний короткостроковий семінар «Управління змінами». Термін навчання: 21-22 вересня 2017 року.'; break;
		case '97':	$groupname='Професійна програма підвищення кваліфікації державних службовців (7-9 группи оплати праці). Термін навчання: 02-13 жовтня 2017 року.'; break;
		case '98':  $groupname='Тематичний короткостроковий семінар «Крос-культурний менеджмент. Крос-культурні комунікації та взаємодія». Термін навчання: 02-03 жовтня'; break;
		case '99':  $groupname='Тематичний короткостроковий семінар «Медіація в публічному управлінні». Термін навчання: 09-10 жовтня'; break;
		case '100': $groupname='Тематичний короткостроковий семінар «Медіаграмотність та медіакультура державних службовців». Термін навчання: 16-17 жовтня'; break;
		case '101': $groupname='Тематичний короткостроковий семінар «Тайм-менеджмент». Термін навчання: 18-19 жовтня'; break;
		case '102': $groupname='Тематичний короткостроковий семінар «Децентралізація влади та децентралізація фінансів в Україні». Термін навчання: 01-02 листопада'; break;
		case '103': $groupname='Тематичний короткостроковий семінар «Управління проектами та програмами». Термін навчання: 06-07 листопада'; break;
		case '104': $groupname='Тематичний короткостроковий семінар «Електронне врядування в публічному управлінні». Термін навчання: 09-10 листопада'; break;
		case '105': $groupname='Тематичний короткостроковий семінар «Антикризове управління в умовах модернізації державного управління». Термін навчання: 15-16 листопада'; break;
		case '106': $groupname='Тематичний короткостроковий семінар «Цифрові технології». Термін навчання: 27-28 листопада'; break;
		case '107': $groupname='Тематичний короткостроковий семінар «Корпоративна культура». Термін навчання: 29-30 листопада'; break;
		
		case '150':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 04-08 вересня 2017 року.'; break;
		case '151':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 11-15 вересня 2017 року.'; break;
		case '152':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 18-22 вересня 2017 року.'; break;
		case '153':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 25-29 вересня 2017 року.'; break;

		
        default:    $groupname=""; break;
	}
	return  $groupname;
}
function vladaname($vladacat){
    switch ($vladacat){
		 case '1': 	$vlada='Апарат Верховної Ради України'; break;
		 case '2': 	$vlada='Адміністрація Президента України'; break;
		 case '3': 	$vlada='Секретаріат Кабінету Міністрів України'; break;
		 case '4': 	$vlada='Рахункова палата'; break;
		 case '5': 	$vlada='Міністерство аграрної політики та продовольства України'; break;
		 case '6': 	$vlada='Міністерство внутрішніх справ України'; break;
		 case '7': 	$vlada='Міністерство екології та природних ресурсів України'; break;
		 case '8': 	$vlada='Міністерство економічного розвитку і торгівлі України'; break;
		 case '9': 	$vlada='Міністерство енергетики та вугільної промисловості України'; break;
		 case '10': $vlada='Міністерство закордонних справ України'; break;
		 case '11': $vlada='Міністерство інформаційної політики України'; break;
		 case '12': $vlada='Міністерство інфраструктури України'; break;
		 case '13': $vlada='Міністерство культури України'; break;
		 case '14': $vlada='Міністерство молоді та спорту України'; break;
		 case '15': $vlada='Міністерство з питань тимчасово окупованих територій та внутрішньо переміщених осіб України'; break;
		 case '16': $vlada='Міністерство оборони України'; break;
		 case '17': $vlada='Генеральний штаб Збройних Сил України'; break;
		 case '18': $vlada='Міністерство освіти і науки України'; break;
		 case '19': $vlada="Міністерство охорони здоров'я України"; break;
		 case '20': $vlada='Міністерство регіонального розвитку, будівництва та житлово-комунального господарства України'; break;
		 case '21': $vlada='Міністерство соціальної політики України'; break;
		 case '22': $vlada='Міністерство фінансів України'; break;
		 case '23': $vlada='Міністерство юстиції України'; break;
		 case '24': $vlada='Державна авіаційна служба України'; break;
		 case '25': $vlada='Державна архівна служба України'; break;
		 case '26': $vlada='Державна аудиторська служба України'; break;
		 case '27': $vlada='Державна казначейська служба України'; break;
		 case '28': $vlada='Державна міграційна служба України'; break;
		 case '29': $vlada='Державна регуляторна служба України'; break;
		 case '30': $vlada='Державна служба геології та надр України'; break;
		 case '31': $vlada='Державна служба експортного контролю України'; break;
		 case '32': $vlada='Державна служба статистики України'; break;
		 case '33': $vlada='Державна служба України з лікарських засобів та контролю за наркотиками'; break;
		 case '34': $vlada='Державна служба України з безпеки на транспорті'; break;
		 case '35': $vlada='Державна служба України з питань безпечності харчових продуктів та захисту споживачів'; break;
		 case '36': $vlada='Державна служба України з питань геодезії, картографії та кадастру'; break;
		 case '37': $vlada='Державна служба України з питань праці'; break;
		 case '38': $vlada='Державна служба України з надзвичайних ситуацій'; break;
		 case '39': $vlada='Державна служба фінансового моніторингу України'; break;
		 case '40': $vlada='Державна фіскальна служба України'; break;
		 case '41': $vlada='Державна служба України у справах ветеранів війни та учасників антитерористичної операції'; break;
		 case '42': $vlada='Державне агентство автомобільних доріг України'; break;
		 case '43': $vlada='Державне агентство водних ресурсів України'; break;
		 case '44': $vlada='Державне агентство з енергоефективності та енергозбереження України'; break;
		 case '45': $vlada='Державне агентство з питань електронного урядування України'; break;
		 case '46': $vlada='Державне агентство лісових ресурсів України'; break;
		 case '47': $vlada='Державне агентство резерву України'; break;
		 case '48': $vlada='Державне агентство рибного господарства України'; break;
		 case '49': $vlada='Державне агентство України з  управління зоною відчуження'; break;
		 case '50': $vlada='Державне агентство України з питань кіно'; break;
		 case '51': $vlada='Державне космічне агентство України'; break;
		 case '52': $vlada='Державна архітектурно-будівельна інспекція України'; break;
		 case '53': $vlada='Державна екологічна інспекція України'; break;
		 case '54': $vlada='Державна інспекція навчальних закладів України'; break;
		 case '55': $vlada='Державна інспекція енергетичного нагляду України'; break;
		 case '56': $vlada='Державна інспекція ядерного регулювання України'; break;
		 case '57': $vlada='Пенсійний фонд України'; break;
		 case '58': $vlada="Український інститут національної пам'яті"; break;
		 case '59': $vlada='Державний комітет телебачення і радіомовлення України'; break;
		 case '60': $vlada='Державне бюро розслідувань'; break;
		 case '61': $vlada='Фонд державного майна України'; break;
		 case '62': $vlada="Адміністрація Державної служби спеціального зв'язку та захисту інформації України"; break;
		 case '63': $vlada='Адміністрація Державної прикордонної служби України'; break;
		 case '64': $vlada='Національне агентство з питань запобігання корупції'; break;
		 case '65': $vlada='Національне агентство з питань виявлення, розшуку та управління активами, одержаними від корупційних та інших злочинів'; break;
		 case '66': $vlada='Національне агентство України з питань державної служби'; break;
		 case '67': $vlada="Національна комісія ,що здійснює державне регулювання у сфері зв'язку та інформатизації"; break;
		 case '68': $vlada='Національна комісія з цінних паперів та фондового ринку'; break;
		 case '69': $vlada='Національна комісія ,що здійснює державне регулювання у сфері ринків фінансових послуг'; break;
		 case '70': $vlada='Національна комісія, що здійснює державне регулювання у сферах енергетики та комунальних послуг(НКРЕКП)'; break;
		 case '71': $vlada='Національна Рада України з питань телебачення і радіомовлення'; break;
		 case '72': $vlada='Національна служба посередництва і примирення'; break;
		 case '73': $vlada='Національна поліція України'; break;
		 case '74': $vlada='Антимонопольний комітет України'; break;
		 case '75': $vlada='Адміністрація Державної спеціальної служби транспорту '; break;

		 default: 	$vlada="none list"; break;
	}
	return $vlada;
}

$groplaty = array(
	1 => array(
		// Категорія посади А
		1 => '1',
		2 => '2',
		3 => '3'
	),
	2 => array(
		// Категорія посади Б
		1 => '4',
		2 => '5',
		3 => '6'
	),
	3 => array(
		// Категорія посади В
		1 => '7',
		2 => '8',
		3 => '9'
	)
);

$rangslug = array(
	1 => array(
		// Категорія посади А
		1 => '1',
		2 => '2',
		3 => '3'
	),
	2 => array(
		// Категорія посади Б
		1 => '3',
		2 => '4',
		3 => '5',
		4 => '6'		
	),
	3 => array(
		// Категорія посади В
		1 => '6',
		2 => '7',
		3 => '8',
		4 => '9'		
	)
);

try {

	//create PDO connection
	$db = new PDO("mysql:host=".DBHOST.";dbname=".DBNAME, DBUSER, DBPASS, array(PDO::MYSQL_ATTR_INIT_COMMAND => 'SET NAMES \'UTF8\''));
	$db->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

	mysql_set_charset('utf8');
	mysql_query("SET NAMES 'utf8';");
	mysql_query("SET CHARACTER SET 'utf8';");
    mysql_query("SET SESSION collation_connection = 'utf8_general_ci';");

} catch(PDOException $e) {
	//show error
    echo '<p class="bg-danger">'.$e->getMessage().'</p>';
    exit;
}

//include the user class, pass in the database connection
include('classes/user.php');
include('classes/phpmailer/mail.php');
$user = new User($db);
?>
