<?php
ob_start();
session_start();
//Debug 
define('DEBUG',false);
define('LOCAL',false);

//set timezone
date_default_timezone_set('Europe/Kiev');
if (defined('LOCAL')&& LOCAL) {
//database credentials denwer
define('DBHOST','localhost');
define('DBUSER','root');
define('DBPASS','');
define('DBNAME','site_db');
}
else {
//database credentials hosting
define("DBHOST", "localhost");
define("DBUSER", "dfsu");
define("DBPASS", "Centre-2017/08/01");
define("DBNAME", "site_db");
}

//application address
define('DIR','http://www.centre-kiev.kiev.ua/register/');
define('SITEEMAIL','noreply.centrekievmail@gmail.com');
function adefine($value) {
	$admin1=$value; echo "adefine=".$admin1."! value=". $value;
	return $value;
}
function grname($groupcat){
    switch ($groupcat) {
        case '20':	$groupname='Модуль 1. «Лідерство та ефективне управління» 4 вересня 2017 року.'; break;
        case '21':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 4 вересня 2017 року.'; break;
		case '22':	$groupname='Модуль 3. «Лідерство та управління персоналом» 4 вересня 2017 року.'; break;
		case '23':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 4 вересня 2017 року.'; break;
		case '24':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 4 вересня 2017 року.'; break;

        case '25':	$groupname='Модуль 1. «Лідерство та ефективне управління» 5 вересня 2017 року.'; break;
        case '26':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 5 вересня 2017 року.'; break;
		case '27':	$groupname='Модуль 3. «Лідерство та управління персоналом 5 вересня 2017 року.'; break;
		case '28':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 5 вересня 2017 року.'; break;
		case '29':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони»5 вересня 2017 року.'; break;

        case '30':	$groupname='Модуль 1. «Лідерство та ефективне управління« 6 вересня 2017 року.'; break;
        case '31':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 6 вересня 2017 року.'; break;
		case '32':	$groupname='Модуль 3. «Лідерство та управління персоналом» 6 вересня 2017 року.'; break;
		case '33':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 6 вересня 2017 року.'; break;
		case '34':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 6 вересня 2017 року.'; break;

        case '35':	$groupname='Модуль 1. «Лідерство та ефективне управління» 7 вересня 2017 року.'; break;
        case '36':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 7 вересня 2017 року.'; break;
		case '37':	$groupname='Модуль 3. «Лідерство та управління персоналом» 7 вересня 2017 року.'; break;
		case '38':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 7 вересня 2017 року.'; break;
		case '39':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 7 вересня 2017 року.'; break;
	
        case '40':	$groupname='Модуль 1. «Лідерство та ефективне управління» 8 вересня 2017 року.'; break;
        case '41':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 8 вересня 2017 року.'; break;
		case '42':	$groupname='Модуль 3. «Лідерство та управління персоналом» 8 вересня 2017 року.'; break;
		case '43':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 8 вересня 2017 року.'; break;
		case '44':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 8 вересня 2017 року.'; break;

        case '50':	$groupname='Модуль 1. «Лідерство та ефективне управління» 18 вересня 2017 року.'; break;
        case '51':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 18 вересня 2017 року.'; break;
		case '52':	$groupname='Модуль 3. «Лідерство та управління персоналом» 18 вересня 2017 року.'; break;
		case '53':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 18 вересня 2017 року.'; break;
		case '54':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 18 вересня 2017 року.'; break;

        case '55':	$groupname='Модуль 1. «Лідерство та ефективне управління» 19 вересня 2017 року.'; break;
        case '56':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 19 вересня 2017 року.'; break;
		case '57':	$groupname='Модуль 3. «Лідерство та управління персоналом» 19 вересня 2017 року.'; break;
		case '58':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 19 вересня 2017 року.'; break;
		case '59':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 19 вересня 2017 року.'; break;

		case '60':	$groupname='Модуль 1. «Лідерство та ефективне управління» 20 вересня 2017 року.'; break;
        case '61':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 20 вересня 2017 року.'; break;
		case '62':	$groupname='Модуль 3. «Лідерство та управління персоналом» 20 вересня 2017 року.'; break;
		case '63':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 20 вересня 2017 року.'; break;
		case '64':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 20 вересня 2017 року.'; break;

        case '65':	$groupname='Модуль 1. «Лідерство та ефективне управління» 21 вересня 2017 року.'; break;
        case '66':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 21 вересня 2017 року.'; break;
		case '67':	$groupname='Модуль 3. «Лідерство та управління персоналом» 21 вересня 2017 року.'; break;
		case '68':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 21 вересня 2017 року.'; break;
		case '69':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 21 вересня 2017 року.'; break;

        case '70':	$groupname='Модуль 1. «Лідерство та ефективне управління» 22 вересня 2017 року.'; break;
        case '71':	$groupname='Модуль 2. «Лідерство та ефективна комунікація» 22 вересня 2017 року.'; break;
		case '72':	$groupname='Модуль 3. «Лідерство та управління персоналом» 22 вересня 2017 року.'; break;
		case '73':	$groupname='Модуль 4. «Лідерство та стратегічне управління державним органом» 22 вересня 2017 року.'; break;
		case '74':	$groupname='Модуль 5. «Европейська та евроантлантична інтеграція. Національна політика в сфері безпеки і оборони» 22 вересня 2017 року.'; break;

        case '90':	$groupname='Професійна програма підвищення кваліфікації державних службовців (6 група оплати праці). Термін навчання: 04-15 вересня 2017 року.'; break;
        case '91':	$groupname='Тематичний короткостроковий семінар «Європейські стандарти демократичного врядування». Термін навчання: 07-08 вересня 2017 року.'; break;
		case '92':	$groupname='Тематичний короткостроковий семінар «Україна-НАТО: напрями співробітництва та партнерства». Термін навчання: 07-08 вересня 2017 року.'; break;
		case '93':	$groupname='Тематичний короткостроковий семінар «Інноваційні технології в публічному управлінні». Термін навчання: 11-12 вересня 2017 року.'; break;
		case '94':	$groupname='Тематичний короткостроковий семінар «Смарт-технології». Термін навчання: 14-15 вересня 2017 року.'; break;

        case '95':	$groupname='Тематичний короткостроковий семінар «Стратегічне управління та планування». Термін навчання: 18-19 вересня 2017 року.'; break;
        case '96':	$groupname='Тематичний короткостроковий семінар «Управління змінами». Термін навчання: 21-22 вересня 2017 року.'; break;
		case '97':	$groupname='Професійна програма підвищення кваліфікації державних службовців (7-9 группи оплати праці). Термін навчання: 02-13 жовтня 2017 року.'; break;
		case '98':  $groupname='Тематичний короткостроковий семінар «Крос-культурний менеджмент. Крос-культурні комунікації та взаємодія». Термін навчання: 02-03 жовтня'; break;
		case '99':  $groupname='Тематичний короткостроковий семінар «Медіація в публічному управлінні». Термін навчання: 09-10 жовтня'; break;
		case '100': $groupname='Тематичний короткостроковий семінар «Медіаграмотність та медіакультура державних службовців». Термін навчання: 16-17 жовтня'; break;
		case '101': $groupname='Тематичний короткостроковий семінар «Тайм-менеджмент». Термін навчання: 18-19 жовтня'; break;
		case '102': $groupname='Тематичний короткостроковий семінар «Децентралізація влади та децентралізація фінансів в Україні». Термін навчання: 01-02 листопада'; break;
		case '103': $groupname='Тематичний короткостроковий семінар «Управління проектами та програмами». Термін навчання: 06-07 листопада'; break;
		case '104': $groupname='Тематичний короткостроковий семінар «Електронне врядування в публічному управлінні». Термін навчання: 09-10 листопада'; break;
		case '105': $groupname='Тематичний короткостроковий семінар «Антикризове управління в умовах модернізації державного управління». Термін навчання: 15-16 листопада'; break;
		case '106': $groupname='Тематичний короткостроковий семінар «Цифрові технології». Термін навчання: 27-28 листопада'; break;
		case '107': $groupname='Тематичний короткостроковий семінар «Корпоративна культура». Термін навчання: 29-30 листопада'; break;
		
		case '150':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 04-08 вересня 2017 року.'; break;
		case '151':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 11-15 вересня 2017 року.'; break;
		case '152':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 18-22 вересня 2017 року.'; break;
		case '153':	$groupname='Професійна програма «Інноваційні технології управління персоналом». Термін навчання: 25-29 вересня 2017 року.'; break;

		
        default:    $groupname=""; break;
	}
	return  $groupname;
}
try {

	//create PDO connection
	$db = new PDO("mysql:host=".DBHOST.";dbname=".DBNAME, DBUSER, DBPASS, array(PDO::MYSQL_ATTR_INIT_COMMAND => 'SET NAMES \'UTF8\''));
	$db->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

	mysql_set_charset('utf8');
	mysql_query("SET NAMES 'utf8';");
	mysql_query("SET CHARACTER SET 'utf8';");
    mysql_query("SET SESSION collation_connection = 'utf8_general_ci';");

} catch(PDOException $e) {
	//show error
    echo '<p class="bg-danger">'.$e->getMessage().'</p>';
    exit;
}

//include the user class, pass in the database connection
include('classes/user.php');
include('classes/phpmailer/mail.php');
$user = new User($db);
?>
